---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetColor(Autodesk.Revit.DB.Color)
source: html/6f5f2e39-a850-5a55-ee09-7d2856209d84.htm
---
# Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetColor Method

Sets the color parameter of the effect instance.

## Syntax (C#)
```csharp
public void SetColor(
	Color color
)
```

## Parameters
- **color** (`Autodesk.Revit.DB.Color`) - The color value.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null